app/controllers/api/actors_controller.rb

SELECT "actors".* FROM "actors"
---
    def index
      render json: Actor.all

SELECT  "actors".* FROM "actors"  WHERE "actors"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
      render json: Actor.find(params[:id])

INSERT INTO "actors" ("created_at", "name", "thumbnail", "updated_at", "year_of_birth") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-11-09 13:09:50.555498"], ["name", "emma watson"], ["thumbnail", "fuu u"], ["updated_at", "2015-11-09 13:09:50.555498"], ["year_of_birth", 5]]
---
    def create
      actor = Actor.new(actor_params)
      if actor.save

SELECT  "actors".* FROM "actors"  WHERE "actors"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "actors" SET "updated_at" = ?, "year_of_birth" = ? WHERE "actors"."id" = 7  [["updated_at", "2015-11-09 13:10:19.092519"], ["year_of_birth", 6]]
---
    def update
      actor = Actor.find(params[:id])
      if actor.update(actor_params)

SELECT  "actors".* FROM "actors"  WHERE "actors"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "actors" WHERE "actors"."id" = ?  [["id", 7]]
---
    def destroy
      actor = Actor.find(params[:id])
      if actor.destroy