app/controllers/api/movies_controller.rb

    def index
      render json: Movie.all
---
SELECT "movies".* FROM "movies"

    def show
      render json: Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 0]]

    def create
      movie = Movie.new(movie_params)
      if movie.save
---
INSERT INTO "movies" ("created_at", "summary", "title", "updated_at", "youtube_embed_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-11-09 13:42:03.913542"], ["summary", "testing.."], ["title", "Munich"], ["updated_at", "2015-11-09 13:42:03.913542"], ["youtube_embed_id", "test_youtube"]]

    def update
      movie = Movie.find(params[:id])
      if movie.update(movie_params)
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "movies" SET "updated_at" = ?, "youtube_embed_id" = ? WHERE "movies"."id" = 4  [["updated_at", "2015-11-09 13:04:59.742467"], ["youtube_embed_id", "oh lol"]]

    def destroy
      movie = Movie.find(params[:id])
      if movie.destroy
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 4]]